In [28]:
import pandas as pd

In [29]:
mydata = "/Users/chris/Documents/Resources/purchase_data_games.csv"

In [30]:
mydata2 = pd.read_csv(mydata, encoding='iso-8859-1', low_memory=False)
mydata2.head()

,SN,Age,Gender,Item ID,Item Name,Price
0,Aelalis34,38,Male,165,Bone Crushing Silver Skewer,3.37
1,Eolo46,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32
2,Assastnya25,34,Male,174,Primitive Blade,2.46
3,Pheusrical25,21,Male,92,Final Critic,1.36
4,Aela59,23,Male,63,Stormfury Mace,1.27

In [31]:
# count of player. it's a distinct count.
player_unique_count = mydata2["SN"].nunique()
player_unique_count

573

In [32]:
# count of unique items based on item ID.
items_unique = mydata2["Item ID"].nunique()
items_unique

183

In [33]:
# Average purchase price
purchase_mean = mydata2["Price"].mean()
purchase_mean

2.931192307692303

In [34]:
# Total Purchase
purchase_count = len(mydata2)
purchase_count

780

In [35]:
# Total Revenue
total_revenue = mydata2["Price"].sum()
total_revenue

2286.3299999999963

In [36]:
# Filter data to get male only
male_count = mydata2.loc[mydata2["Gender"] == "Male"]
male_count.head()

,SN,Age,Gender,Item ID,Item Name,Price
0,Aelalis34,38,Male,165,Bone Crushing Silver Skewer,3.37
1,Eolo46,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32
2,Assastnya25,34,Male,174,Primitive Blade,2.46
3,Pheusrical25,21,Male,92,Final Critic,1.36
4,Aela59,23,Male,63,Stormfury Mace,1.27

In [37]:
# count of Male
male_count_distinct=male_count["SN"].nunique()
male_percentage = (male_count_distinct/player_unique_count)*100
print(f"Total Male: {male_count_distinct}\nPercentage Male: {male_percentage}")

Total Male: 465
Percentage Male: 81.15183246073299

In [38]:
# Filter data to get female only
female_count = mydata2.loc[mydata2["Gender"] == "Female"]
female_count.head()

,SN,Age,Gender,Item ID,Item Name,Price
7,Iathenudil29,29,Female,169,"Interrogator, Blood Blade of the Queen",3.32
16,Sundista85,22,Female,123,Twilight's Carver,1.14
17,Aenarap34,22,Female,59,"Lightning, Etcher of the King",1.65
22,Deural48,11,Female,11,Brimstone,2.52
29,Phaedai25,16,Female,45,Glinting Glass Edge,2.46

In [39]:
# count of Female
female_count_distinct=female_count["SN"].nunique()
female_percentage = (female_count_distinct/player_unique_count)*100
print(f"Total Female:{female_count_distinct}\nPercentage Female:{female_percentage}")

Total Female:100
Percentage Female:17.452006980802793

In [40]:
# others count
others_count = player_unique_count - (male_count_distinct+female_count_distinct)
percentage_others = (others_count/player_unique_count)*100
print(f"Total Others:{others_count}\nPercentage Others:{percentage_others}")

Total Others:8
Percentage Others:1.3961605584642234

In [41]:
# DF to get Purchase Count
male_data_pcount=pd.DataFrame(male_count.groupby("Gender")["Item ID"].count())
male_data_pcount.reset_index(inplace=True)
male_data_pcount.columns=["Gender","Purchase Count"]
male_data_pcount.head()

  Gender  Purchase Count
0   Male             633

In [42]:
# DF to get Price Average
male_data_paverage=pd.DataFrame(male_count.groupby("Gender")["Price"].mean())
male_data_paverage.reset_index(inplace=True)
male_data_paverage.columns=["Gender","Average Price"]
male_data_paverage.head()

  Gender  Average Price
0   Male       2.950521

In [43]:
# DF to get Total Purchase
male_data_ptotal=pd.DataFrame(male_count.groupby("Gender")["Price"].sum())
male_data_ptotal.reset_index(inplace=True)
male_data_ptotal.columns=["Gender","Total Price"]
male_data_ptotal.head()

  Gender  Total Price
0   Male      1867.68

In [44]:
# Male Merged Data_step1
male_merged1=pd.merge(male_data_pcount, male_data_paverage, on="Gender")
male_merged1.head()

  Gender  Purchase Count  Average Price
0   Male             633       2.950521

In [45]:
# Male stats complete merge
male_stat_complete=pd.merge(male_merged1,male_data_ptotal, on="Gender")
male_stat_complete.head()

  Gender  Purchase Count  Average Price  Total Price
0   Male             633       2.950521      1867.68

In [46]:
# Female stats complete merge
female_data_pcount=pd.DataFrame(female_count.groupby("Gender")["Item ID"].count())
female_data_pcount.reset_index(inplace=True)
female_data_pcount.columns=["Gender","Purchase Count"]

female_data_paverage=pd.DataFrame(female_count.groupby("Gender")["Price"].mean())
female_data_paverage.reset_index(inplace=True)
female_data_paverage.columns=["Gender","Average Price"]

female_data_ptotal=pd.DataFrame(female_count.groupby("Gender")["Price"].sum())
female_data_ptotal.reset_index(inplace=True)
female_data_ptotal.columns=["Gender","Total Price"]

female_merged1=pd.merge(female_data_pcount, female_data_paverage, on="Gender")
female_stat_complete=pd.merge(female_merged1,female_data_ptotal, on="Gender")
female_stat_complete.head()

   Gender  Purchase Count  Average Price  Total Price
0  Female             136       2.815515       382.91

In [47]:
# Other stats complete merge
others_count = mydata2.loc[mydata2["Gender"] == "Other / Non-Disclosed"]

others_data_pcount=pd.DataFrame(others_count.groupby("Gender")["Item ID"].count())
others_data_pcount.reset_index(inplace=True)
others_data_pcount.columns=["Gender","Purchase Count"]

others_data_paverage=pd.DataFrame(others_count.groupby("Gender")["Price"].mean())
others_data_paverage.reset_index(inplace=True)
others_data_paverage.columns=["Gender","Average Price"]

others_data_ptotal=pd.DataFrame(others_count.groupby("Gender")["Price"].sum())
others_data_ptotal.reset_index(inplace=True)
others_data_ptotal.columns=["Gender","Total Price"]

others_merged1=pd.merge(others_data_pcount, others_data_paverage, on="Gender")
others_stat_complete=pd.merge(others_merged1,others_data_ptotal, on="Gender")
others_stat_complete.head()

                  Gender  Purchase Count  Average Price  Total Price
0  Other / Non-Disclosed              11       3.249091        35.74

In [49]:
# Top 5 spenders. total price by distinct players
top_spenders = pd.DataFrame(mydata2.groupby("SN")["Price"].count())
top_spenders.reset_index(inplace=True)
top_spenders.columns=["SN","Purchase count"]


top_spenders1 = pd.DataFrame(mydata2.groupby("SN")["Price"].mean())
top_spenders1.reset_index(inplace=True)
top_spenders1.columns=["SN","Average Purchase"]

top_spenders2 = pd.DataFrame(mydata2.groupby("SN")["Price"].sum())
top_spenders2.reset_index(inplace=True)
top_spenders2.columns=["SN","Total Purchase Price"]


merge1=pd.merge(top_spenders,top_spenders1,on="SN")
merge2=pd.merge(merge1,top_spenders2,on="SN")


top_5_spenders = merge2.sort_values(["Total Purchase Price"],ascending=[False])
top_5_spenders.head(5)

              SN  Purchase count  Average Purchase  Total Purchase Price
538  Undirrala66               5          3.412000                 17.06
428     Saedue76               4          3.390000                 13.56
354  Mindimnya67               4          3.185000                 12.74
181   Haellysu29               3          4.243333                 12.73
120       Eoda93               3          3.860000                 11.58

In [91]:
# Top 5 Popular items
top_popular = pd.DataFrame(mydata2.groupby(["Item ID","Item Name","Price"])["SN"].count())
top_popular.reset_index(inplace=True)
top_popular.columns=["Item ID","Item Name","Item Price","Purchase count"]

top_popular1 = pd.DataFrame(mydata2.groupby("Item ID")["Price"].sum())
top_popular1.reset_index(inplace=True)
top_popular1.columns=["Item ID","Total Purchase Price"]

new_table=pd.merge(top_popular,top_popular1,on="Item ID")

top_5_popular = new_table.sort_values(["Purchase count"],ascending=[False])
top_5_popular.columns=["Item ID","Item Name","Item Price","Purchase count","Total Purchase Price"]
top_5_popular.head(5)

,Item ID,Item Name,Item Price,Purchase count,Total Purchase Price
39,39,"Betrayal, Whisper of Grieving Widows",2.35,11,25.85
84,84,Arcane Gem,2.23,11,24.53
31,31,Trickster,2.07,9,18.63
174,175,Woeful Adamantite Claymore,1.24,9,11.16
13,13,Serenity,1.49,9,13.41

In [55]:
# Top 5 Profitable items
top_profitable = pd.DataFrame(mydata2.groupby(["Item ID","Item Name","Price"])["SN"].count())
top_profitable.reset_index(inplace=True)
top_profitable.columns=["Item ID","Item Name","Price","Purchase count"]

top_profitable1 = pd.DataFrame(mydata2.groupby("Item ID")["Price"].sum())
top_profitable1.reset_index(inplace=True)
top_profitable1.columns=["Item ID","Total Purchase Price"]

new_table1=pd.merge(top_profitable,top_profitable1,on="Item ID")

top_5_profitable = new_table.sort_values(["Total Purchase Price"],ascending=[False])
top_5_profitable.columns=["Item ID","Item Name","Item Price","Purchase count","Total Purchase Price"]
top_5_profitable.head(5)

,Item ID,Item Name,Item Price,Purchase count,Total Purchase Price
34,34,Retribution Axe,4.14,9,37.26
115,115,Spectral Diamond Doomblade,4.25,7,29.75
32,32,Orenmir,4.95,6,29.70
103,103,Singed Scalpel,4.87,6,29.22
107,107,"Splitter, Foe Of Subtlety",3.61,8,28.88

In [56]:
#Max and Min for Bins
print(mydata2["Age"].max())
print(mydata2["Age"].min())

45
7

In [58]:
# create Bins
bins = [0,4,8,12,16,20,24,28,32,36,40,44,48]
labels = ["less than 4","4 to 8","8 to 12","12 to 16","16 to 20","20 to 24","24 to 28","28 to 32","32 to 36","36 to 40","40 to 44","44 to 48"]

In [59]:
pd.cut(mydata2["Age"],bins,labels=labels)

0      36 to 40
1      20 to 24
2      32 to 36
3      20 to 24
4      20 to 24
5      16 to 20
6      16 to 20
7      28 to 32
8      24 to 28
9      28 to 32
10     20 to 24
11     16 to 20
12     28 to 32
13     20 to 24
14     36 to 40
15     20 to 24
16     20 to 24
17     20 to 24
18     24 to 28
19     28 to 32
20     20 to 24
21     12 to 16
22      8 to 12
23     16 to 20
24      8 to 12
25     20 to 24
26     28 to 32
27     32 to 36
28     12 to 16
29     12 to 16
         ...
750    20 to 24
751    24 to 28
752    12 to 16
753    16 to 20
754    28 to 32
755    20 to 24
756    20 to 24
757    32 to 36
758    16 to 20
759    16 to 20
760    28 to 32
761    24 to 28
762    32 to 36
763    24 to 28
764    24 to 28
765    12 to 16
766    20 to 24
767    16 to 20
768    20 to 24
769    20 to 24
770    20 to 24
771    20 to 24
772    12 to 16
773    20 to 24
774    20 to 24
775    20 to 24
776    12 to 16
777    16 to 20
778    16 to 20
779    20 to 24
Name: Age, Length: 780, dtype: category
Categories (12, object): [less than 4 < 4 to 8 < 8 to 12 < 12 to 16 ... 32 to 36 < 36 to 40 < 40 to 44 < 44 to 48]

In [61]:
mydata2["Age Group"] = pd.cut(mydata2["Age"],bins,labels=labels)
mydata2.head()

,SN,Age,Gender,Item ID,Item Name,Price,Age Group
0,Aelalis34,38,Male,165,Bone Crushing Silver Skewer,3.37,36 to 40
1,Eolo46,21,Male,119,"Stormbringer, Dark Blade of Ending Misery",2.32,20 to 24
2,Assastnya25,34,Male,174,Primitive Blade,2.46,32 to 36
3,Pheusrical25,21,Male,92,Final Critic,1.36,20 to 24
4,Aela59,23,Male,63,Stormfury Mace,1.27,20 to 24

In [85]:
age_groups=pd.DataFrame(mydata2.groupby("Age Group")["Price"].count())
age_groups.reset_index(inplace=True)
age_groups1=pd.DataFrame(mydata2.groupby("Age Group")["Price"].mean())
age_groups1.reset_index(inplace=True)
age_groups2=pd.DataFrame(mydata2.groupby("Age Group")["Price"].sum())
age_groups2.reset_index(inplace=True)

merge_age=pd.merge(age_groups,age_groups1, on="Age Group")
demographic=pd.merge(merge_age,age_groups2, on = "Age Group")
demographic.columns=["Age Group","Purchase count","Average Price","Total Price"]
demographic.head(11)

      Age Group  Purchase count  Average Price  Total Price
0   less than 4               0            NaN          NaN
1        4 to 8              22       2.788182        61.34
2       8 to 12              24       3.385417        81.25
3      12 to 16              87       2.745862       238.89
4      16 to 20             161       2.907019       468.03
5      20 to 24             238       2.924748       696.09
6      24 to 28             104       2.974712       309.37
7      28 to 32              66       3.061970       202.09
8      32 to 36              38       2.981053       113.28
9      36 to 40              37       2.901351       107.35
10     40 to 44               2       2.960000         5.92

In [82]:
# Trends
# 1- Male are into video games more than Female
# 2- Youth between 20-24 age group spend more on video games purchases than other groups
# 3- less expensive games are sold more than expensive ones